Repository: imeelinew/Obelisk
Catalog: Obelisk/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: 「最近浏览」最多显示的网页数量
en: Maximum pages shown under Recent Browsing

source: 「最近添加」最多显示的书签数量
en: Maximum bookmarks shown under Recently Added

# About Obelisk
source: 关于 Obelisk
en: About Obelisk

# bookmark.action.pin
source: 置顶
en: Pin

# Bring All to Front
source: 将全部窗口前置
en: Bring All to Front

# Check for Updates…
source: 检查更新…
en: Check for Updates…

# Check Spelling Now
source: 立即检查拼写
en: Check Spelling Now

# Check Spelling While Typing
source: 键入时检查拼写
en: Check Spelling While Typing

# Clear Menu
source: 清除菜单
en: Clear Menu

# Close
source: 关闭
en: Close

# Copy
source: 拷贝
en: Copy

# Customize Toolbar…
source: 自定工具栏…
en: Customize Toolbar…

# Cut
source: 剪切
en: Cut

# Delete
source: 删除
en: Delete

source: Dia 和 Chrome 会复用 Obelisk 创建的无痕窗口；其他 Chromium 浏览器使用启动参数
en: Dia and Chrome reuse the private window created by Obelisk; other Chromium browsers use launch arguments

# Edit
source: 编辑
en: Edit

# Emoji & Symbols
source: 表情与符号
en: Emoji & Symbols

# Enter Full Screen
source: 进入全屏幕
en: Enter Full Screen

# File
source: 文件
en: File

# Find
source: 查找
en: Find

# Find Next
source: 查找下一个
en: Find Next

# Find Previous
source: 查找上一个
en: Find Previous

# Find…
source: 查找…
en: Find…

# Help
source: 帮助
en: Help

# Hide Obelisk
source: 隐藏 Obelisk
en: Hide Obelisk

# Hide Others
source: 隐藏其他
en: Hide Others

source: Intelligence 书签优化
en: Intelligence Bookmark Optimization

source: Intelligence 功能
en: Intelligence Features

source: Intelligence 功能已关闭
en: Intelligence Features Are Off

source: Intelligence 请求失败，请稍后再试
en: Intelligence request failed, try again later

source: Intelligence 配置无效，请检查设置中的 API Key、模型和服务地址
en: Intelligence configuration is invalid; check the API key, model, and service URL in Settings

# Jump to Selection
source: 跳到所选内容
en: Jump to Selection

# Minimize
source: 最小化
en: Minimize

# New Bookmark
source: 新建书签
en: New Bookmark

# Obelisk Help
source: Obelisk 帮助
en: Obelisk Help

source: Obelisk 会自动将超过这个天数没有打开的书签归档
en: Obelisk automatically archives bookmarks that haven’t been opened for this many days

source: Obelisk 只读显示所选浏览器最近访问过的网页
en: Obelisk shows recently visited pages from the selected browsers in read-only mode

# Open Recent
source: 打开最近的文件
en: Open Recent

# Open…
source: 打开…
en: Open…

# Page Setup…
source: 页面设置…
en: Page Setup…

# Paste
source: 粘贴
en: Paste

# Print…
source: 打印…
en: Print…

# Quit Obelisk
source: 退出 Obelisk
en: Quit Obelisk

# Redo
source: 重做
en: Redo

# Revert To Saved
source: 复原到已存储
en: Revert To Saved

# Save
source: 存储
en: Save

# Save As…
source: 另存为…
en: Save As…

# Select All
source: 全选
en: Select All

# Settings…
source: 设置…
en: Settings…

# Show All
source: 显示全部
en: Show All

# Show Spelling and Grammar
source: 显示拼写和语法
en: Show Spelling and Grammar

# Show Substitutions
source: 显示替换
en: Show Substitutions

# Show Toolbar
source: 显示工具栏
en: Show Toolbar

# Smart Copy/Paste
source: 智能拷贝/粘贴
en: Smart Copy/Paste

# Smart Dashes
source: 智能破折号
en: Smart Dashes

# Smart Links
source: 智能链接
en: Smart Links

# Smart Quotes
source: 智能引号
en: Smart Quotes

# Speech
source: 语音
en: Speech

# Spelling and Grammar
source: 拼写和语法
en: Spelling and Grammar

# Start Speaking
source: 开始朗读
en: Start Speaking

# Stop Speaking
source: 停止朗读
en: Stop Speaking

# Substitutions
source: 替换
en: Substitutions

# Text Replacement
source: 文本替换
en: Text Replacement

# Undo
source: 撤销
en: Undo

# Use Selection for Find
source: 使用所选内容查找
en: Use Selection for Find

# View
source: 显示
en: View

# Window
source: 窗口
en: Window

# Zoom
source: 缩放
en: Zoom

source: 不可用
en: Unavailable

source: 专业
en: Professional

source: 个书签
en: bookmarks

source: 为 Obelisk 窗口启用毛玻璃半透明材质
en: Enable frosted-glass translucency for Obelisk windows

source: 主题
en: Theme

source: 书签
en: Bookmarks

source: 书签优化
en: Optimize Bookmarks

source: 书签优化正在进行中
en: Bookmark Optimization in Progress

source: 云同步
en: Cloud Sync

source: 云服务
en: Cloud Services

source: 云账户
en: Cloud Account

source: 今天
en: Today

source: 优化中
en: Optimizing

source: 优化全部可用书签的标题与分组
en: Optimize Titles and Collections of All Eligible Bookmarks

source: 优化选中书签的标题与分组
en: Optimize Titles and Collections of Selected Bookmarks

source: 优化选中隐藏书签的标题
en: Optimize Titles of Selected Hidden Bookmarks

source: 优化隐藏书签
en: Optimize Hidden Bookmarks

source: 你确定吗？开启自定义透明度可能会大幅降低可读性
en: Are you sure? Custom opacity can greatly reduce readability

source: 使用无痕窗口打开隐藏书签
en: Open Hidden Bookmarks in Private Windows

source: 例如:GitHub
en: e.g. GitHub

source: 侧边栏
en: Sidebar

source: 保存
en: Save

source: 偏好
en: Preferences

source: 停止同步并移除本机保存的登录信息，不会删除本地书签
en: Stops sync and removes saved sign-in info on this Mac without deleting local bookmarks

source: 全部
en: All

source: 共计 %lld 个书签
en: Total bookmarks: %lld

source: 内容
en: Content

source: 最近浏览
en: History

source: 最近浏览数量
en: Recent Browsing Limit

source: 最近添加
en: Recently Added

source: 最近添加数量
en: Recently Added Limit

source: 出错了
en: Something Went Wrong

source: 分组
en: Collections

source: 分组名称
en: Collection Name

source: 列表
en: List

source: 创建
en: Create

source: 删除
en: Delete

source: 删除书签?
en: Delete Bookmark?

source: 删除分组
en: Delete Collection

source: 删除分组?
en: Delete Collection?

source: 删除选中的书签
en: Delete Selected Bookmarks

source: 删除选中的分组
en: Delete Selected Collections

source: 删除选中的隐藏书签
en: Delete Selected Hidden Bookmarks

source: 包含关键字的 URL 只能添加到「隐藏书签」
en: URLs containing these keywords can only be added as Hidden Bookmarks

source: 卡片
en: Cards

source: 取消
en: Cancel

source: 取消置顶
en: Unpin

source: 取消置顶?
en: Unpin bookmarks?

source: 取消置顶选中的书签
en: Unpin Selected Bookmarks

source: 可用
en: Available

source: 同步
en: Sync

source: 同步失败
en: Sync Failed

source: 同步将停止，登录信息会从本机移除，本地书签不会被删除
en: Sync will stop and sign-in info will be removed from this Mac; local bookmarks won’t be deleted

source: 同步服务器
en: Sync Server

source: 同步状态
en: Sync Status

source: 启动
en: Startup

source: 启用窗口透明效果
en: Enable Window Transparency

source: 图标样式
en: Icon Style

source: 图标风格
en: Icon Style

source: 在你的设备之间同步书签、分组和最近浏览，关闭云同步后，Obelisk 仍会将所有数据保存在本机
en: Sync bookmarks, collections, and recent browsing across your devices; with cloud sync off, Obelisk still keeps all data on this Mac

source: 在侧边栏显示隐藏书签
en: Show Hidden Bookmarks in Sidebar

source: 在登录时启动 Obelisk
en: Launch Obelisk at Login

source: 域名显示
en: Domain Display

source: 复制 URL
en: Copy URL

source: 外观
en: Appearance

source: 多彩
en: Colorful

source: 好
en: OK

source: 实心
en: Filled

source: 实时同步服务
en: Realtime Sync Service

source: 密码
en: Password

source: 将选中的书签移到其他分组
en: Move Selected Bookmarks to Another Collection

source: 将选中的书签移到分组
en: Move Selected Bookmarks to a Collection

source: 尚未完成同步
en: Not Synced Yet

source: 已关闭
en: Off

source: 已关闭登录时启动
en: Launch at Login Disabled

source: 已创建分组
en: Collection Created

source: 已删除分组
en: Collection Deleted

source: 已取消置顶
en: Unpinned

source: 已同步
en: Synced

source: 已复制 URL
en: URL Copied

source: 已开启登录时启动
en: Launch at Login Enabled

source: 已恢复
en: Restored

source: 已恢复原标题
en: Original Title Restored

source: 已放入分组的书签在「分组」页查看
en: Bookmarks in collections appear on the Collections page

source: 已置顶
en: Pinned

source: 已连接
en: Connected

source: 已连接云账户
en: Connected to Cloud Account

source: 已重命名分组
en: Collection Renamed

source: 开启 Intelligence 功能
en: Enable Intelligence Features

source: 开启云同步功能
en: Enable Cloud Sync

source: 开启后 Obelisk 会自动归档您一段时间没有使用的书签
en: When enabled, Obelisk automatically archives bookmarks you haven’t used for a while

source: 开启后书签列表会显示完整 URL
en: When enabled, bookmark lists show the full URL

source: 开启后可手动调整窗口透明度
en: When enabled, you can manually adjust window opacity

source: 开启后将自动使用配置的模型优化新添加的书签标题
en: When enabled, newly added bookmark titles are optimized with the configured model

source: 开启后将自动使用配置的模型把新添加的可见书签归入合适分组
en: When enabled, newly added visible bookmarks are placed into suitable collections with the configured model

source: 开启自定义透明度?
en: Enable Custom Opacity?

source: 归档
en: Archive

source: 归档书签
en: Archived Bookmarks

source: 归档书签?
en: Archive bookmarks?

source: 当前浏览器标签无有效网址
en: Current Browser Tab Has No Valid URL

source: 当前浏览器没有可读取的窗口
en: Current Browser Has No Readable Window

source: 当前透明度
en: Current Opacity

source: 当前默认浏览器不支持无痕打开
en: Default Browser Doesn’t Support Private Opening

source: 快捷键
en: Shortcuts

source: 恢复到书签
en: Restore to Bookmarks

source: 恢复到书签?
en: Restore to bookmarks?

source: 恢复原标题
en: Restore Original Title

source: 您手动归档的书签会显示在这里
en: Bookmarks you archive manually appear here

source: 所选书签无法恢复原标题（需已 Intelligence 优化且保存了原标题）
en: Selected bookmarks can’t restore original titles (requires Intelligence optimization with a saved original title)

source: 打开
en: Open

source: 打开完整磁盘访问权限设置
en: Open Full Disk Access Settings

source: 找不到所选浏览器的历史数据库
en: Couldn’t Find History Database for Selected Browser

source: 找不到这个书签
en: Bookmark Not Found

source: 按 ⌥H 可以把当前浏览器标签添加为隐藏书签
en: Press ⌥H to add the current browser tab as a hidden bookmark

source: 按使用频率
en: By Frequency

source: 按最近添加
en: By Recently Added

source: 按名称
en: By Name

source: 排除关键词
en: Excluded Keywords

source: 提示
en: Notice

source: 搜索
en: Search

source: 新建
en: New

source: 新建分组
en: New Collection

source: 无法保存书签
en: Couldn’t Save Bookmark

source: 无法恢复原标题
en: Couldn’t Restore Original Title

source: 无法打开无痕窗口
en: Couldn’t Open Private Window

source: 无法添加此书签
en: Couldn’t Add This Bookmark

source: 无法读取 Safari 浏览历史，请在“系统设置 > 隐私与安全性 > 完整磁盘访问权限”中允许 Obelisk，然后重新启动 Obelisk
en: Couldn’t read Safari browsing history; allow Obelisk in System Settings > Privacy & Security > Full Disk Access, then restart Obelisk

source: 无法读取最近浏览
en: Couldn’t Read Recent Browsing

source: 无法读取当前浏览器标签
en: Couldn’t Read Current Browser Tab

source: 昨天
en: Yesterday

source: 显示完整网站域名
en: Show Full Website Domain

source: 未分组
en: Ungrouped

source: 未启用
en: Disabled

source: 未检测
en: Not Checked

source: 未知日期
en: Unknown Date

source: 未连接
en: Disconnected

source: 本地服务通常不校验 Key，填任意非空字符串即可
en: Local services usually don’t validate the key; any non-empty string works

source: 本地模型 (LM Studio)
en: Local Model (LM Studio)

source: 查看隐藏书签
en: View Hidden Bookmarks

source: 标题
en: Title

source: 模型来源
en: Model Source

source: 模型没有返回可用的分组
en: Model Didn’t Return a Usable Collection

source: 模型没有返回可用的标题
en: Model Didn’t Return a Usable Title

source: 模型配置
en: Model Configuration

source: 正在上传
en: Uploading

source: 正在下载
en: Downloading

source: 正在同步
en: Syncing

source: 正在读取最近浏览…
en: Reading Recent Browsing…

source: 正在连接
en: Connecting

source: 此账户用于验证云端数据的访问权限
en: This account verifies access to your cloud data

source: 没有书签被移动
en: No Bookmarks Were Moved

source: 没有最近浏览
en: No Recent Browsing

source: 没有可见书签
en: No Visible Bookmarks

source: 没有启用书签优化项目
en: No Bookmark Optimization Options Enabled

source: 没有归档书签
en: No Archived Bookmarks

source: 没有未分组的书签
en: No Ungrouped Bookmarks

source: 没有标题被更新
en: No Titles Were Updated

source: 没有结果
en: No Results

source: 没有读取权限
en: No Read Permission

source: 没有需要优化的标题
en: No Titles Need Optimization

source: 没有需要自动分组的书签
en: No Bookmarks Need Auto-Grouping

source: 测试中…
en: Testing…

source: 测试模型连接
en: Test Model Connection

source: 测试连接
en: Test Connection

source: 浏览器
en: Browsers

source: 添加
en: Add

source: 添加书签
en: Add Bookmark

source: 添加隐藏书签
en: Add Hidden Bookmark

source: 点击工具栏 + 创建分组
en: Click + in the Toolbar to Create a Collection

source: 点击工具栏的 + 添加你的第一个书签
en: Click + in the toolbar to add your first bookmark

source: 用于访问云端 OpenAI 兼容服务的 API Key
en: API key for accessing a cloud OpenAI-compatible service

source: 登录并开启同步
en: Sign In and Enable Sync

source: 确定
en: Confirm

source: 移出分组?
en: Remove from collection?

source: 移到「%@」?
en: Move to “%@”?

source: 移到分组
en: Move to Collection

source: 移到隐藏书签
en: Move to Hidden Bookmarks

source: 移到隐藏书签?
en: Move to hidden bookmarks?

source: 移动
en: Move

source: 稍后
en: Later

source: 空心
en: Outline

source: 窗口
en: Window

source: 等待连接
en: Waiting for Connection

source: 编辑
en: Edit

source: 编辑书签
en: Edit Bookmark

source: 网址
en: URL

source: 网址格式不正确
en: Invalid URL

source: 置顶
en: Pinned

source: 置顶书签?
en: Pin bookmarks?

source: 置顶选中的书签
en: Pin Selected Bookmarks

source: 自动优化新书签标题
en: Auto-Optimize New Bookmark Titles

source: 自动分组新书签
en: Auto-Group New Bookmarks

source: 自动归档
en: Auto-Archive

source: 自动归档闲置书签
en: Auto-Archive Idle Bookmarks

source: 自动检测
en: Auto

source: 自动翻译非中文标题
en: Auto-Translate Non-Chinese Titles

source: 自定义透明度
en: Custom Opacity

source: 菜单栏
en: Menu Bar

source: 菜单栏排序
en: Menu Bar Order

source: 设置
en: Settings

source: 语言
en: Language

source: 语言将在重新打开后生效
en: Language takes effect after relaunch

source: 请先切到要添加的浏览器标签页
en: Switch to the Browser Tab You Want to Add First

source: 请先选择一个浏览器
en: Choose a Browser First

source: 请在“隐私与安全性 > 自动化”允许 Obelisk 控制默认浏览器
en: Allow Obelisk to control the default browser in Privacy & Security > Automation

source: 请在“隐私与安全性 > 自动化”允许 Obelisk 控制当前浏览器
en: Allow Obelisk to control the current browser in Privacy & Security > Automation

source: 请在“隐私与安全性 > 辅助功能”允许 Obelisk
en: Allow Obelisk in Privacy & Security > Accessibility

source: 请在系统设置中允许 Obelisk 登录时启动
en: Allow Obelisk to launch at login in System Settings

source: 请稍候…
en: Please Wait…

source: 读取当前浏览器标签超时
en: Timed Out Reading Current Browser Tab

source: 还没有书签
en: No Bookmarks Yet

source: 还没有分组
en: No Collections Yet

source: 还没有可用分组
en: No Collections Available Yet

source: 还没有配置 Intelligence 模型，请先在设置中填写 API Key 和模型
en: Intelligence model isn’t configured yet; enter the API key and model in Settings first

source: 还没有隐藏书签
en: No Hidden Bookmarks Yet

source: 远程 API
en: Remote API

source: 远程 API 的 chat completions 地址
en: Chat completions URL for the remote API

source: 远程服务的模型名称，如 gpt-4.1-mini
en: Remote model name, such as gpt-4.1-mini

source: 连接中
en: Connecting

source: 连接失败
en: Connection Failed

source: 连接成功
en: Connected

source: 退出云账户
en: Sign Out of Cloud Account

source: 退出云账户？
en: Sign Out of Cloud Account?

source: 退出账户
en: Sign Out

source: 选择浏览器
en: Choose Browsers

source: 透出去
en: See-Through

source: 透明 + 标题栏透明
en: Transparent + Transparent Title Bar

source: 透明度
en: Opacity

source: 邮箱
en: Email

source: 重命名
en: Rename

source: 重命名分组
en: Rename Collection

source: 重命名选中的分组
en: Rename Selected Collection

source: 重新打开
en: Relaunch

source: 重新打开 Obelisk?
en: Relaunch Obelisk?

source: 重新认证
en: Reauthenticate

source: 重试中…
en: Retrying…

source: 重试同步
en: Retry Sync

source: 闲置书签会在达到设定天数后自动归档
en: Idle bookmarks are archived automatically after the set number of days

source: 闲置天数
en: Idle Days

source: 隐私
en: Privacy

source: 隐藏书签
en: Hidden

source: 隐藏书签和归档书签不会显示在这里
en: Hidden and archived bookmarks don’t appear here

source: 需要登录
en: Sign-In Required

source: 须与 LM Studio Local Server 里已加载模型的 id 一致
en: Must match the id of a model loaded in LM Studio Local Server

source: 须先在本机启动 LM Studio Local Server（默认端口 1234）
en: Start LM Studio Local Server on this Mac first (default port 1234)

source: 高级
en: Advanced

source: 默认
en: Default

source: 默认不透明
en: Opaque by Default
